Revit 2023 API
PathReinforcement.IsSolidInView Method
 Checks if this Path Reinforcement is shown solidly in a 3D view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The PathReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")]
public bool IsSolidInView(
	View3D view
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The PathReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")> _
Public Function IsSolidInView ( _
	view As View3D _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The PathReinforcement will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")]
public:
bool IsSolidInView(
	View3D^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View3D
 The 3D view element
Return Value
 True if Path Reinforcement is shown solidly, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  This element doesn't have valid visibility data.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace